eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: R_CMT_CreateOneShotAssignChannelPriority
********************************************************************************************************************//**
* @brief This function configures the desired CMT channel for the requested period with desired interrupt priority level,
* associates a user callback function with the timer’s interrupt, powers up and starts the timer
* @param[in] period_us Desired period in microseconds.
* The range and resolution of the timer is determined by settings of the peripheral clock.
* The best pre-scaler for the CMT channel is chosen by the driver.\n
* @param[in] callback Pointer to the user’s callback function. It should data a single void * argument.\n
* @param[in] channel Desired CMT channel that is used to configure.\n
* @param[in] priority Desired priority level of timer’s interrupt:\n
* CMT_PRIORITY_0: Interrupt is disabled\n
* CMT_PRIORITY_1: Lowest interrupt priority\n
* CMT_PRIORITY_2\n
* CMT_PRIORITY_3\n
* CMT_PRIORITY_4\n
* CMT_PRIORITY_5\n
* CMT_PRIORITY_6\n
* CMT_PRIORITY_7\n
* CMT_PRIORITY_8\n
* CMT_PRIORITY_9\n
* CMT_PRIORITY_10\n
* CMT_PRIORITY_11\n
* CMT_PRIORITY_12\n
* CMT_PRIORITY_13\n
* CMT_PRIORITY_14\n
* CMT_PRIORITY_15: Highest interrupt priority\n
* @retval true  Successful; CMT initialized\n
* @retval false     No free CMT channels available, or invalid settings\n
* @details The R_CMT_CreateOneShotAssignChannelPriority assigns the desired
* CMT channel to the caller with desired interrupt priority level,
* and registers a user callback function to be called upon the compare match event.
* The CMT is configured to generate a compare match after the period specified in the call.
* The timer is shut down after a single compare match event.\n
* @note 1.  Invalid settings\n
* The function will return false if one of the following invalid settings occurs:
* invalid channel, invalid priority, channel was in used, or frequency could not be used.\n
*/
bool R_CMT_CreateOneShotAssignChannelPriority (uint32_t period_us, void (* callback)(void * pdata), uint32_t channel, cmt_priority_t priority)
{
    return cmt_create_priority((1000000/period_us), callback, CMT_RX_MODE_ONE_SHOT, channel, priority);
}
/* End of function R_CMT_CreateOneShotAssignChannelPriority */

/***********************************************************************************************************************
* Function Name: R_CMT_Stop
********************************************************************************************************************//**
* @brief Stops a CMT channel and powers down the CMT unit if possible
* @param[in] channel The CMT timer channel to stop\n
* @retval true  Successful; CMT closed\n
* @retval false     Invalid settings \n
* @details This function frees the CMT channel by clearing its assignment and disabling the associated interrupt.
* The CMT channel cannot be used again until it has been reopened with either 
* the R_CMT_CreatePeriodic or the R_CMT_CreateOneShot function.
* If the CMT channel is already used as RTOS system timer, a call to this function with this CMT channel as channel,
* will result in FALSE being returned
*/
bool R_CMT_Stop (uint32_t channel)
{
    /* Make sure valid channel number was input. */
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
    if (channel >= CMT_RX_NUM_CHANNELS)
#elif BSP_CFG_RTOS_USED == 1        /* FreeRTOS */
    if ((channel >= CMT_RX_NUM_CHANNELS) || (BSP_CFG_RTOS_SYSTEM_TIMER == channel))
//#elif BSP_CFG_RTOS_USED == 2  /* SEGGER embOS */
//#elif BSP_CFG_RTOS_USED == 3  /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED   == 4  /* Renesas RI600V4 & RI600PX */
    if ((channel >= CMT_RX_NUM_CHANNELS) || (BSP_CFG_RTOS_SYSTEM_TIMER == channel) || (_RI_TRACE_TIMER == channel))
#else /* Non-OS & others */
    if (channel >= CMT_RX_NUM_CHANNELS)
#endif/* BSP_CFG_RTOS_USED */
    {
        /* Invalid channel number was used.*/
        /*In case using RX23W, Channel 2 and 3 are reserved by BLE FIT modules v.1.00*/
        return false;
    }

    /* Stop counter. */
    cmt_counter_stop(channel);

    /* Turn off power to channel. */
    power_off(channel);

    /* Set mode to disabled. */
    g_cmt_modes[channel] = CMT_RX_MODE_DISABLED;

    /* Set channel as available. */
    R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMT0 + channel));

    return true;
} /* End of function R_CMT_Stop */

/***********************************************************************************************************************
* Function Name: R_CMT_Control
********************************************************************************************************************//**
* @brief This function provides various ways to control and monitor a CMT channel
* @param[in] channel CMT channel number to control.\n
* @param[in] command Command to execute:\n
* CMT_RX_CMD_IS_CHANNEL_COUNTING\n
* CMT_RX_CMD_PAUSE\n
* CMT_RX_CMD_RESUME\n
* CMT_RX_CMD_RESTART\n
* CMT_RX_CMD_GET_NUM_CHANNELS\n
* CMT_RX_CMD_SET_PRIORITY\n
* CMT_RX_CMD_GET_PRIORITY\n
* @param[in] *pdata
* @retval true  The command completed properly. Check pdata
* @retval false     The command did not complete properly
* @details This function provides a number of commands:\n
* CMT_RX_CMD_IS_CHANNEL_COUNTING tells if a CMT channel is currently running.  Check *pdata.\n
* CMT_RX_CMD_PAUSE pauses a timer without closing it (without powering it off).\n
* CMT_RX_CMD_RESUME restarts a paused timer without resetting the counter to zero\n
* CMT_RX_CMD_RESTART restarts a paused timer after resetting the counter to zero\n
* CMT_RX_CMD_GET_NUM_CHANNELS returns the total number of channels available\n
* CMT_RX_CMD_SET_PRIORITY sets the interrupt priority of the CMT channel.\n
* CMT_RX_CMD_GET_PRIORITY gets the interrupt priority of the CMT channel.\n
* If the CMT channel is already used as RTOS system timer, a call to this function with this CMT channel as channel,
* and any of CMT_RX_CMD_IS_CHANNEL_COUNTING, CMT_RX_CMD_PAUSE,
* CMT_RX_CMD_RESUME, CMT_RX_CMD_RESTART as command, will result in FALSE being returned.
*/
bool R_CMT_Control (uint32_t channel, cmt_commands_t command, void * pdata)
{
    bool ret = true;
    cmt_priority_t priority;

#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
    if (CMT_RX_CMD_GET_NUM_CHANNELS == command)
    {
        /* Return the number of CMT channels on this MCU. */
        *(uint32_t *)pdata = CMT_RX_NUM_CHANNELS;
        ret = true;
        return ret;
    }
    else if ((channel == BSP_CFG_RTOS_SYSTEM_TIMER) || (channel >= CMT_RX_NUM_CHANNELS))
    {
        /* Specified CMT channel is being used by RTOS or Invalid channel */
        /* Modifying is NOT allowed for the other commands. */
        ret = false;
        return ret;
    }
    else
    {
        /* Do nothing. */
    }
//#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
//#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */

    if (CMT_RX_CMD_GET_NUM_CHANNELS == command)
    {
        /* Return the number of CMT channels on this MCU. */
        *(uint32_t *)pdata = CMT_RX_NUM_CHANNELS;
        ret = true;
        return ret;
    }
    else if ((channel == BSP_CFG_RTOS_SYSTEM_TIMER) || (channel == _RI_TRACE_TIMER) || (channel >= CMT_RX_NUM_CHANNELS))
    {
        /* Specified CMT channel is being used by RTOS or Invalid channel */
        /* Modifying is NOT allowed for the other commands. */
        ret = false;
        return ret;
    }
    else
    {
        /* Do nothing. */
    }
#else /* Non-OS & others */
#endif/* BSP_CFG_RTOS_USED */

