eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: cmt_create
* Description  : Sets up a CMT channel based on user input options.
* Arguments    : frequency_hz -
*                    Frequency in Hz of how often to call the callback function.
*                callback -
*                    Which function to call when timer expires.
*                mode -
*                    Current mode of CMT channel
*                channel -
*                    Pointer of where to store which channel was used.
* Return Value : true - 
*                    Channel initialized successfully.
*                false -
*                    Invalid channel or period could not be used.
***********************************************************************************************************************/
static bool cmt_create (uint32_t frequency_hz, void (* callback)(void * pdata), cmt_modes_t mode, uint32_t * channel)
{
    /* Return value. */
    bool     ret = false;    

    /* Grab state to make sure we do not interfere with another operation. */
    if (cmt_lock_state() != true)
    {
        /* Another operation is already in progress. */
        return false;
    }

    /* Was a channel found? */
    if (false == cmt_find_channel(channel))
    {
        /* Channel not found or not available. */
        ret = false;
    }
    else
    {
        /* Look to see if we can support this frequency. */
        ret = cmt_setup_channel(*channel, frequency_hz);
    
        /* Set up ICU registers, save callback function, and start counter if valid divider was found. */
        if (true == ret)
        {        
            /* Set mode of operation. */
            g_cmt_modes[*channel] = mode;
    
            /* Save callback function to be used. */
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
            g_cmt_callbacks[*channel] = callback;
#elif BSP_CFG_RTOS_USED == 1        /* FreeRTOS */
            g_cmt_callbacks[*channel] = callback;
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
    #if CMT_RX_NUM_CHANNELS == 2
        #if ((BSP_CFG_RTOS_SYSTEM_TIMER != 0 && _RI_TRACE_TIMER != 0) ||\
            (BSP_CFG_RTOS_SYSTEM_TIMER != 1 && _RI_TRACE_TIMER != 1))
            g_cmt_callbacks[*channel] = callback;
        #endif
    #else
            g_cmt_callbacks[*channel] = callback;
    #endif
#else
            g_cmt_callbacks[*channel] = callback;
#endif

    
            /* Start channel counting. */
            cmt_counter_start(*channel);
        }
        else
        {
            /* Could not support input frequency. Release lock on channel. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMT0 + (*channel)));
        }
    }

    /* Release state so other operations can be performed. */
    cmt_unlock_state();

    return ret;
}
/* End of function cmt_create */

/***********************************************************************************************************************
* Function Name: cmt_create_priority
* Description  : Sets up a CMT channel based on user input options with interrupt priority.
* Arguments    : frequency_hz -
*                    Frequency in Hz of how often to call the callback function.
*                callback -
*                    Which function to call when timer expires.
*                mode -
*                    Current mode of CMT channel
*                channel -
*                    Which channel is used to create.
*                priority -
*                    Which interrupt priority is used to assign.
* Return Value : true -
*                    Channel initialized successfully.
*                false -
*                    Invalid channel, invalid priority, channel was in used, or frequency could not be used.
***********************************************************************************************************************/
static bool cmt_create_priority (uint32_t frequency_hz, void (* callback)(void * pdata), cmt_modes_t mode, uint32_t channel, cmt_priority_t priority)
{
    /* Return value. */
    bool     ret = false;

    /* Check if interrupt priority and channel are correct or not. */
    if ((CMT_PRIORITY_0 > (int8_t) priority) || (CMT_PRIORITY_MAX < priority) || (CMT_RX_NUM_CHANNELS <= channel))
    {
        return false;
    }

    /* Grab state to make sure we do not interfere with another operation. */
    if (cmt_lock_state() != true)
    {
        /* Another operation is already in progress. */
        return false;
    }

    /* Acquire lock on input channel. If return value is true then this channel is NOT in use. */
    if (true == R_BSP_HardwareLock((mcu_lock_t)(BSP_LOCK_CMT0 + channel)))
    {
        /* Look to see if we can support this frequency. */
        ret = cmt_setup_channel(channel, frequency_hz);

        /* Set up ICU registers, save callback function, and start counter if valid divider was found. */
        if (true == ret)
        {
            /* Set mode of operation. */
            g_cmt_modes[channel] = mode;

            /* Save callback function to be used. */
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
            g_cmt_callbacks[channel] = callback;
#elif BSP_CFG_RTOS_USED == 1        /* FreeRTOS */
            g_cmt_callbacks[channel] = callback;
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
    #if CMT_RX_NUM_CHANNELS == 2
        #if ((BSP_CFG_RTOS_SYSTEM_TIMER != 0 && _RI_TRACE_TIMER != 0) ||\
            (BSP_CFG_RTOS_SYSTEM_TIMER != 1 && _RI_TRACE_TIMER != 1))
            g_cmt_callbacks[channel] = callback;
        #endif
    #else
            g_cmt_callbacks[channel] = callback;
    #endif
#else
            g_cmt_callbacks[channel] = callback;
#endif

            /* Start channel counting. */
            cmt_counter_start_priority(channel, priority);
        }
        else
        {
            /* Could not support input frequency. Release lock on channel. */
            R_BSP_HardwareUnlock((mcu_lock_t)(BSP_LOCK_CMT0 + (channel)));
        }
    }

    /* Release state so other operations can be performed. */
    cmt_unlock_state();

    return ret;
}
/* End of function cmt_create_priority */

