eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
                /* No need to check other dividers. */
                break;
            }
        }
    }

    return ret;
}
/***********************************************************************************************************************
* End of function cmt_setup_channel
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name: R_CMT_GetVersion
********************************************************************************************************************//**
* @brief This function returns the driver version number at runtime
* @return Version number with major and minor version digits packed into a single 32-bit value.
* @details The function returns the version of this module.
* The version number is encoded such that the top 2 bytes are the major version number
* and the bottom 2 bytes are the minor version number.
*/
uint32_t R_CMT_GetVersion (void)
{
    /* These version macros are defined in r_cmt_rx_if.h. */
    return ((((uint32_t)CMT_RX_VERSION_MAJOR) << 16) | (uint32_t)CMT_RX_VERSION_MINOR);
}
/* End of function R_CMT_GetVersion */

/***********************************************************************************************************************
* Function Name: cmt_isr_common
* Description  : Common part of ISR handling. Put here and made inline so changes will always apply to all channels.
* Arguments    : channel -
*                    Which channel this is for.
* Return Value : none
***********************************************************************************************************************/
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
R_BSP_PRAGMA_STATIC_INLINE(cmt_isr_common)
void cmt_isr_common (uint32_t channel)
{
    /* If this is one-shot mode then stop timer. */
    if (CMT_RX_MODE_ONE_SHOT == g_cmt_modes[channel])
    {
        R_CMT_Stop(channel);
    }

    /* Check for valid callback pointer before calling it. */
    if ((NULL != g_cmt_callbacks[channel]) && ((uint32_t)FIT_NO_FUNC != (uint32_t)g_cmt_callbacks[channel]))
    {
        /* Valid callback found, jump to it. */
        g_cmt_callbacks[channel]((void *)&channel);
    }
}
/* End of function cmt_isr_common */
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
R_BSP_PRAGMA_STATIC_INLINE(cmt_isr_common)
void cmt_isr_common (uint32_t channel)
{
    /* If this is one-shot mode then stop timer. */
    if (CMT_RX_MODE_ONE_SHOT == g_cmt_modes[channel])
    {
        R_CMT_Stop(channel);
    }

    /* Check for valid callback pointer before calling it. */
    if ((NULL != g_cmt_callbacks[channel]) && ((uint32_t)FIT_NO_FUNC != (uint32_t)g_cmt_callbacks[channel]))
    {
        /* Valid callback found, jump to it. */
        g_cmt_callbacks[channel]((void *)&channel);
    }
}
/* End of function cmt_isr_common */
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
    #if CMT_RX_NUM_CHANNELS == 2
        #if ((BSP_CFG_RTOS_SYSTEM_TIMER != 0 && _RI_TRACE_TIMER != 0) ||\
            (BSP_CFG_RTOS_SYSTEM_TIMER != 1 && _RI_TRACE_TIMER != 1))
            R_BSP_PRAGMA_STATIC_INLINE(cmt_isr_common)
            void cmt_isr_common (uint32_t channel)
            {
                /* If this is one-shot mode then stop timer. */
                if (CMT_RX_MODE_ONE_SHOT == g_cmt_modes[channel])
                {
                    R_CMT_Stop(channel);
                }

                /* Check for valid callback pointer before calling it. */
                if ((NULL != g_cmt_callbacks[channel]) && ((uint32_t)FIT_NO_FUNC != (uint32_t)g_cmt_callbacks[channel]))
                {
                    /* Valid callback found, jump to it. */
                    g_cmt_callbacks[channel]((void *)&channel);
                }
            }
            /* End of function cmt_isr_common */
        #endif
    #else
        R_BSP_PRAGMA_STATIC_INLINE(cmt_isr_common)
        void cmt_isr_common (uint32_t channel)
        {
            /* If this is one-shot mode then stop timer. */
            if (CMT_RX_MODE_ONE_SHOT == g_cmt_modes[channel])
            {
                R_CMT_Stop(channel);
            }

            /* Check for valid callback pointer before calling it. */
            if ((NULL != g_cmt_callbacks[channel]) && ((uint32_t)FIT_NO_FUNC != (uint32_t)g_cmt_callbacks[channel]))
            {
                /* Valid callback found, jump to it. */
                g_cmt_callbacks[channel]((void *)&channel);
            }
        }
        /* End of function cmt_isr_common */
    #endif /* End of  CMT_RX_NUM_CHANNELS */
#else /* Non-OS & others */
    R_BSP_PRAGMA_STATIC_INLINE(cmt_isr_common)
    void cmt_isr_common (uint32_t channel)
    {
        /* If this is one-shot mode then stop timer. */
        if (CMT_RX_MODE_ONE_SHOT == g_cmt_modes[channel])
        {
            R_CMT_Stop(channel);
        }

        /* Check for valid callback pointer before calling it. */
        if ((NULL != g_cmt_callbacks[channel]) && ((uint32_t)FIT_NO_FUNC != (uint32_t)g_cmt_callbacks[channel]))
        {
            /* Valid callback found, jump to it. */
            g_cmt_callbacks[channel]((void *)&channel);
        }
    }
#endif /* BSP_CFG_RTOS_USED */
/* End of function cmt_isr_common */

/***********************************************************************************************************************
* Function Name: cmt0_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
R_BSP_PRAGMA_STATIC_INTERRUPT (cmt0_isr,VECT(CMT0, CMI0))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt0_isr (void)
{
    cmt_isr_common(0);
}
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 0)
        R_BSP_PRAGMA_STATIC_INTERRUPT (cmt0_isr,VECT(CMT0, CMI0))
        R_BSP_ATTRIB_STATIC_INTERRUPT void cmt0_isr (void)
        {
            cmt_isr_common(0);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 0) */
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 0 && _RI_TRACE_TIMER != 0)
        void cmt0_isr (void)
        {
            cmt_isr_common(0);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 0 && _RI_TRACE_TIMER != 0) */
#else /* Non-OS & others */
R_BSP_PRAGMA_STATIC_INTERRUPT (cmt0_isr,VECT(CMT0, CMI0))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt0_isr (void)
{
    cmt_isr_common(0);
}
#endif/* BSP_CFG_RTOS_USED */
/* End of function cmt0_isr */

