eclipse-threadx/getting-started/Renesas/RX65N_Cloud_Kit/lib/rx_driver_package/src/smc_gen/r_cmt_rx/src/r_cmt_rx.c
/***********************************************************************************************************************
* Function Name: cmt1_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
R_BSP_PRAGMA_STATIC_INTERRUPT (cmt1_isr,VECT(CMT1, CMI1))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt1_isr (void)
{
    cmt_isr_common(1);
}
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 1)
        R_BSP_PRAGMA_STATIC_INTERRUPT (cmt1_isr,VECT(CMT1, CMI1))
        R_BSP_ATTRIB_STATIC_INTERRUPT void cmt1_isr (void)
        {
            cmt_isr_common(1);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 1) */
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 1 && _RI_TRACE_TIMER != 1)
        void cmt1_isr (void)
        {
            cmt_isr_common(1);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 1 && _RI_TRACE_TIMER != 1) */
#else /* Non-OS & others */
R_BSP_PRAGMA_STATIC_INTERRUPT (cmt1_isr,VECT(CMT1, CMI1))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt1_isr (void)
{
    cmt_isr_common(1);
}
#endif/* BSP_CFG_RTOS_USED */
/* End of function cmt1_isr */

#if   CMT_RX_NUM_CHANNELS == 4

/***********************************************************************************************************************
* Function Name: cmt2_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
R_BSP_PRAGMA_STATIC_INTERRUPT(cmt2_isr,VECT(CMT2, CMI2))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt2_isr (void)
{
    cmt_isr_common(2);
}
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 2)
        R_BSP_PRAGMA_STATIC_INTERRUPT(cmt2_isr,VECT(CMT2, CMI2))
        R_BSP_ATTRIB_STATIC_INTERRUPT void cmt2_isr (void)
        {
            cmt_isr_common(2);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 2) */
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 2 && _RI_TRACE_TIMER != 2)
        void cmt2_isr (void)
        {
            cmt_isr_common(2);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 2 && _RI_TRACE_TIMER != 2) */
#else /* Non-OS & others */
R_BSP_PRAGMA_STATIC_INTERRUPT(cmt2_isr,VECT(CMT2, CMI2))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt2_isr (void)
{
    cmt_isr_common(2);
}
#endif/* BSP_CFG_RTOS_USED */
/* End of function cmt2_isr */

/***********************************************************************************************************************
* Function Name: cmt3_isr
* Description  : Interrupt when compare match for this channel occurs.
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
#if BSP_CFG_RTOS_USED == 0      /* Non-OS */
R_BSP_PRAGMA_STATIC_INTERRUPT( cmt3_isr,VECT(CMT3, CMI3))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt3_isr (void)
{
    cmt_isr_common(3);
}
#elif BSP_CFG_RTOS_USED == 1    /* FreeRTOS */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 3)
        R_BSP_PRAGMA_STATIC_INTERRUPT (cmt3_isr,VECT(CMT3, CMI3))
        R_BSP_ATTRIB_STATIC_INTERRUPT void cmt3_isr (void)
        {
            cmt_isr_common(3);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 3) */
#elif BSP_CFG_RTOS_USED == 2    /* SEGGER embOS */
#elif BSP_CFG_RTOS_USED == 3    /* Micrium MicroC/OS */
#elif BSP_CFG_RTOS_USED == 4    /* Renesas RI600V4 & RI600PX */
    #if (BSP_CFG_RTOS_SYSTEM_TIMER != 3 && _RI_TRACE_TIMER != 3)
        void cmt3_isr (void)
        {
            cmt_isr_common(3);
        }
    #endif /* (BSP_CFG_RTOS_SYSTEM_TIMER != 3 && _RI_TRACE_TIMER != 3) */
#else /* Non-OS & others */
R_BSP_PRAGMA_STATIC_INTERRUPT( cmt3_isr,VECT(CMT3, CMI3))
R_BSP_ATTRIB_STATIC_INTERRUPT void cmt3_isr (void)
{
    cmt_isr_common(3);
}
#endif/* BSP_CFG_RTOS_USED */
/* End of function cmt3_isr */
#endif /* End of #if CMT_RX_NUM_CHANNELS == 4 */
